### Dealing with missing data

In [1]:
import pandas as pd
import numpy as np

#### Verifying if a value is null

In [2]:
pd.isnull(np.nan), pd.isnull(None)

(True, True)

In [3]:
pd.isna(np.nan), pd.isna(None)

(True, True)

In [4]:
pd.isnull('a'), pd.isna('a')

(False, False)

#### Verifying if a value is not null

In [5]:
pd.notnull(np.nan), pd.notnull(None)

(False, False)

In [6]:
pd.notna(np.nan), pd.notna(None)

(False, False)

In [7]:
pd.notnull('a'), pd.notna('a')

(True, True)

These functions also work with Series and DataFrames

In [8]:
pd.isnull(pd.Series([10, np.nan, 1])), pd.isna(pd.Series([10, np.nan, 1]))

(0    False
 1     True
 2    False
 dtype: bool,
 0    False
 1     True
 2    False
 dtype: bool)

In [9]:
pd.isnull(
    pd.DataFrame({
        'A': [1, None, 'a'], 
        'B': [np.nan, 0.3, 'b'], 
        'C': [3, None, np.nan]
    }, index=['W', 'X', 'Y'])
)

       A      B      C
W  False   True  False
X   True  False   True
Y  False  False   True

In [10]:
pd.isna(
    pd.DataFrame({
        'A': [1, None, 'a'], 
        'B': [np.nan, 0.3, 'b'], 
        'C': [3, None, np.nan]
    }, index=['W', 'X', 'Y'])
)

       A      B      C
W  False   True  False
X   True  False   True
Y  False  False   True

#### Pandas operations with missing data

Counting the non-null values

In [11]:
pd.Series([1, 2, np.nan]).count()

2

Summing the non-null values in the series

In [12]:
pd.Series([1, 2, None]).sum()

3.0

Mean of the non-null values in the series (sum of non-null values / number of non-null values)

In [13]:
pd.Series([1, 2, np.nan]).mean()

1.5

Getting the number of non-null values through sum()

In [14]:
s = pd.Series(['a', 3, np.nan, 1, np.nan, None, 'abc', 0.8, ''])

print(s.notnull().sum())

6

#### Filtering missing data

In [15]:
s = pd.Series(['a', 3, np.nan, 1, np.nan, None, 'abc', 0.8, '#'])

In [16]:
s[pd.notnull(s)], s[pd.notna(s)]

(0      a
 1      3
 3      1
 6    abc
 7    0.8
 8      #
 dtype: object,
 0      a
 1      3
 3      1
 6    abc
 7    0.8
 8      #
 dtype: object)

In [17]:
s[pd.isnull(s)], s[pd.isna(s)]

(2     NaN
 4     NaN
 5    None
 dtype: object,
 2     NaN
 4     NaN
 5    None
 dtype: object)

#### Dropping null values

In [18]:
s.dropna()

0      a
1      3
3      1
6    abc
7    0.8
8      #
dtype: object

You can also drop values from DataFrames

In [19]:
df = pd.DataFrame({
    'Column A': [1, np.nan, 30, np.nan],
    'Column B': [2, 8, 31, np.nan],
    'Column C': [np.nan, 9, 32, 100],
    'Column D': [5, 8, 34, 110],
})
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [20]:
df.isnull()

   Column A  Column B  Column C  Column D
0     False     False      True     False
1      True     False     False     False
2     False     False     False     False
3      True      True     False     False

Seeing how many null values we have per column

In [21]:
df.isnull().sum()

Column A    2
Column B    1
Column C    1
Column D    0
dtype: int64

All the rows with null values will be dropped if we use dropna()

In [22]:
df.dropna()

   Column A  Column B  Column C  Column D
2      30.0      31.0      32.0        34

If we want to drop columns with null values, we add the argument axis=1 or axis='columns'

In [23]:
df.dropna(axis=1)

   Column D
0         5
1         8
2        34
3       110

If you just want to drop rows where all the values are null, you can use the parameter how='all'

In [24]:
df.dropna(how='all')

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

If you use how='any', it will have the same effect as the dropna(), since how='any' is the default of dropna()

In [25]:
df.dropna(how='any')

   Column A  Column B  Column C  Column D
2      30.0      31.0      32.0        34

If you want to have a minimum number of non-null values in a row, use thresh=number

In [26]:
df.dropna(thresh=3)

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34

If you want to have a minimum number of non-null values in a column, use thresh=number and axis=1 or axis='column'

In [27]:
df.dropna(thresh=3, axis=1)

   Column B  Column C  Column D
0       2.0       NaN         5
1       8.0       9.0         8
2      31.0      32.0        34
3       NaN     100.0       110

#### Filling null values

Filling null values with 0

In [28]:
s = pd.Series([1, np.nan, 2, 3, None, 4])

In [29]:
s.fillna(0)

0    1.0
1    0.0
2    2.0
3    3.0
4    0.0
5    4.0
dtype: float64

Filling null values with the mean value

In [30]:
s.fillna(s.mean())

0    1.0
1    2.5
2    2.0
3    3.0
4    2.5
5    4.0
dtype: float64

##### Filling nulls with contiguous (close) values

The method argument is used to fill null values with other values close to that null one:

- ffill: front filling values, fill missing values based on the previous ones
- bfill: back filling values, fill missing values based on the next ones

In [31]:
s.fillna(method='ffill')

C:\Users\nayfr\AppData\Local\Temp\ipykernel_19004\1029756637.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  s.fillna(method='ffill')

0    1.0
1    1.0
2    2.0
3    3.0
4    3.0
5    4.0
dtype: float64

In [32]:
s.fillna(method='bfill')

C:\Users\nayfr\AppData\Local\Temp\ipykernel_19004\1641295691.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  s.fillna(method='bfill')

0    1.0
1    2.0
2    2.0
3    3.0
4    4.0
5    4.0
dtype: float64

In case of values in the extremities of the series, this methods may not work, because they need the previous or the next values to operate

In [33]:
pd.Series([np.nan, 2, 3, 4, 5]).fillna(method='ffill')

C:\Users\nayfr\AppData\Local\Temp\ipykernel_19004\302810015.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  pd.Series([np.nan, 2, 3, 4, 5]).fillna(method='ffill')

0    NaN
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [34]:
pd.Series([1, 2, 3, 4, np.nan]).fillna(method='bfill')

C:\Users\nayfr\AppData\Local\Temp\ipykernel_19004\962157099.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  pd.Series([1, 2, 3, 4, np.nan]).fillna(method='bfill')

0    1.0
1    2.0
2    3.0
3    4.0
4    NaN
dtype: float64

##### Filling null values in DataFrame
In DataFrames, you can specify the axis (as usual, rows or columns) to use to fill the values (specially for methods) and that you have more control on the values passed:

In [35]:
df.fillna({'Column A': -1, 'Column B': 1000, 'Column C': df['Column C'].mean()})

   Column A  Column B  Column C  Column D
0       1.0       2.0      47.0         5
1      -1.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3      -1.0    1000.0     100.0       110

In [36]:
df.fillna(method='ffill',axis=0)

C:\Users\nayfr\AppData\Local\Temp\ipykernel_19004\2614524743.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill',axis=0)

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       1.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3      30.0      31.0     100.0       110

In [37]:
df.fillna(method='ffill',axis=1)

C:\Users\nayfr\AppData\Local\Temp\ipykernel_19004\2272395643.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill',axis=1)

   Column A  Column B  Column C  Column D
0       1.0       2.0       2.0       5.0
1       NaN       8.0       9.0       8.0
2      30.0      31.0      32.0      34.0
3       NaN       NaN     100.0     110.0

In [38]:
df.fillna(method='bfill',axis=0)

C:\Users\nayfr\AppData\Local\Temp\ipykernel_19004\2743158383.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='bfill',axis=0)

   Column A  Column B  Column C  Column D
0       1.0       2.0       9.0         5
1      30.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [39]:
df.fillna(method='bfill',axis=1)

C:\Users\nayfr\AppData\Local\Temp\ipykernel_19004\3381026564.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='bfill',axis=1)

   Column A  Column B  Column C  Column D
0       1.0       2.0       5.0       5.0
1       8.0       8.0       9.0       8.0
2      30.0      31.0      32.0      34.0
3     100.0     100.0     100.0     110.0

#### Checking for NAs

In [40]:
s.dropna().count() #counting the non-na values

4

In [41]:
missing_values = len(s.dropna()) != len(s) # number of non-na values != number of items in s
missing_values # if true, there are still na values

True

Another method to find if there are still na values

In [42]:
missing_values = s.count() != len(s) # number of non-na values != number of items in s
missing_values # if true, there are still na values

True

You can also use any(), to verify if any of the values are non-na or all(), to verify if all of the values are non-na

In [43]:
pd.Series([None, False, np.nan]).any(), pd.Series([None, False, np.nan]).all()

(False, False)

In [44]:
pd.Series([None, False, 'a']).any(), pd.Series([None, False, 'a']).all()

(True, False)

In [45]:
pd.Series([None, False, np.nan]).any(), pd.Series([1, 'a', .6]).all()

(False, True)

In [46]:
pd.Series([None, 1, np.nan]).any(), pd.Series([2, 3, '8']).all()

(True, True)

Combining isnull() and any():

In [47]:
pd.Series([1, np.nan]).isnull().any()

True

In [48]:
pd.Series([1, 2]).isnull().any()

False

Checking the values of a series and using any()

In [49]:
s.isnull().values

array([False,  True, False, False,  True, False])

In [50]:
s.isnull().values.any()

True